## Homework

Lets create a data frame as in the ex_data_structures file (Class 1 excercise 1)

In [72]:
import pandas as pd
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]
data={'Names':names, 'Woman':woman, 'Ages':ages, 'Country':country, 'Education':education}
friends=pd.DataFrame.from_dict(data)
friends

     Names  Woman  Ages  Country Education
0    Tomás  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master

### Queries:

Where is the youngest male in the group from?

In [69]:
#Find the answer using sort_values()
toSort=["Ages"]
Order=[False]
friends[friends.Woman==False].sort_values(by=toSort,ascending=Order).tail(1).Country

2    Spain
Name: Country, dtype: object

In [76]:
#Find the answer using where() and min()
 
friendsmale=friends.where(friends.Woman == False) 
friendsmale[friendsmale.Ages==min(friendsmale.Ages)].Country

2    Spain
Name: Country, dtype: object

In [78]:
#Find the answer using query() and min()

friendsmale=friends.query('Woman == False') #'Woman == False' is a string
friendsmale[friendsmale.Ages==min(friendsmale.Ages)].Country

2    Spain
Name: Country, dtype: object